# 01 Data Set

In [24]:
import pandas as pd

In [25]:
data = pd.read_table('http://bit.ly/chiporders')

In [26]:
data.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [27]:
# data.head()
# data.tail()
data.shape

(4622, 5)

In [28]:
col_names = ['ID', 'Age', 'Gender', 'Occupation', 'Revenue']

In [29]:
data2 = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=col_names)

In [30]:
data2

      ID  Age Gender     Occupation Revenue
0      1   24      M     technician   85711
1      2   53      F          other   94043
2      3   23      M         writer   32067
3      4   24      M     technician   43537
4      5   33      F          other   15213
..   ...  ...    ...            ...     ...
938  939   26      F        student   33319
939  940   32      M  administrator   02215
940  941   20      M        student   97229
941  942   48      F      librarian   78209
942  943   22      M        student   77841

[943 rows x 5 columns]

# 02 Series and Data Frame

In [32]:
type(data2['Age'])

pandas.core.series.Series

In [33]:
data2.Age

0      24
1      53
2      23
3      24
4      33
       ..
938    26
939    32
940    20
941    48
942    22
Name: Age, Length: 943, dtype: int64

In [35]:
data2.Age

0      24
1      53
2      23
3      24
4      33
       ..
938    26
939    32
940    20
941    48
942    22
Name: Age, Length: 943, dtype: int64